# 第一次实验

<font face="楷体" size=5 >姓名： 李骥铮</font>

<font face="楷体" size=5>学号： U202011976</font>

<font face="楷体" size=5>班级： 临床2103班</font>

<font face="楷体" size=5>指导教师： 黄正军</font>

<font face="楷体" size=5>实验时间：2022年4月20日 </font>

## 实验名称

静态路由与默认路由配置

## 实验目的

- 掌握基本的路由器配置命令

- 配置静态路由和默认路由。

## 实验内容

### 1. 布置拓扑

​		拓扑图如下图所示：

![](C:\Users\23623\Desktop\QQ图片20220507103430.png)

<center>图1：路由器交换机与终端的拓扑配置</center>`

## 2. 配置终端机与路由器

### （1）配置IP地址，子网掩码和默认网关

如下图所示

![](C:\Users\23623\Desktop\QQ图片20220507103533.png)

<center>图2 IP地址，子网掩码和默认网关的配置</center>`

IP地址配置完成之后，路由器和交换机，路由器和路由器之间均为红色，此时未激活相应端口，需要输入如下指令：

```shell
Router(config)#int f0/0 // 选择路由器端口
Router(config-if)#no sh // 激活该端口
Router(config-if)#int f0/1
Router(config-if)#no sh
```

以激活连接端口。

### (2)配置静态路由

R0:

```shell
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2
Router(config)#ip route 192.168.4.0 255.255.255.0 192.168.2.2
```

R1:

```shell
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1
Router(config)#ip route 192.168.4.0 255.255.255.0 192.168.3.2
```

R2:

```shell
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.3.1
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.3.1
```

配置完之后，我们可以看一下路由表

```shell
S 192.168.1.0/24 [1/0] via 192.168.2.1
C 192.168.2.0/24 is directly connected, FastEthernet0/0
C 192.168.3.0/24 is directly connected, FastEthernet0/1
S 192.168.4.0/24 [1/0] via 192.168.3.2
```

### (3)检查在静态路由下，网络的连通情况

![](C:\Users\23623\Desktop\QQ图片20220507104317.png)

<center>图3 静态路由下，两台终端机的联通情况</center>`

### （4）配置默认路由

在前面配置的基础上，删除静态路由，再增加一条默认路由即可。

R0:

```
Router(config)#no ip route 192.168.3.0 255.255.255.0 192.168.2.2
Router(config)#no ip route 192.168.4.0 255.255.255.0 192.168.2.2
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.2.2
```

R2:

```
Router(config)#no ip route 192.168.1.0 255.255.255.0 192.168.3.1
Router(config)#no ip route 192.168.2.0 255.255.255.0 192.168.3.1
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.3.1
```

查看 R0 的路由表，其中，以 S*开头的为默认路由

```
Gateway of last resort is 192.168.2.2 to network 0.0.0.0
C 192.168.1.0/24 is directly connected, FastEthernet0/0
C 192.168.2.0/24 is directly connected, FastEthernet0/1
S* 0.0.0.0/0 [1/0] via 192.168.2.2
```

验证网络的连通情况：
与静态路由类似，默认路由配置好后，同样可以从 PC1 ping PC0 检查网络的连通情况，直到 ping 通为止。

![](C:\Users\23623\Desktop\aaa.png)

<center>图4 默认路由下，两台终端机的联通情况</center>`

### 问题及解决过程

本次实验遇到的第一个棘手的问题是，端口一直无法正确连接，显示为红色的问题。后来自己进行检查，以及和同学交流，确定了是未开启端口的问题。

### 回答问题

#### 1. 简单讨论 192.168.1.0 和 192.168.1.255 这两个 IP 地址所代表的含义。

- 主机ID全为0的地址：特指某个网段，比如：192.168.10.0 255.255.255.0，指192.168.10.0网段。
- 主机ID全为1的地址：特指该网段的全部主机，比如：192.168.10.255，如果你的计算机发送数据包使用主机ID全是1的IP地址，数据链层地址用广播地址FF-FF-FF-FF-FF-FF。

#### 2.在配置 R0 静态路由时，命令“ip route 192.168.3.0 255.255.255.0 192.168.2.2”中，192.168.3.0 和 192.168.2.2 分别代表什么？能不能用 192.168.3.1 代替 192.168.3.0，用192.168.2.1 代替 192.168.2.2？请测试并说明原因。

1. 这条指令表明要去192.168.3.0网络需要向192.168.2.2接口发送数据包,192.168.3.0为目的IP，192.168.2.2为途径接口的IP
2. 不能,因为192.168.3.0指的是一个网段，而192.168.3.1指的是R1路由器的一个端口。
3. 不能用192.168.2.1 代替 192.168.2.2，因为是要向192.168.2.2发送数据包，而不是192.168.2.1端口

#### 若 PC 不配置默认网关，PC0 和 PC1 是否能够相互 ping 通？进行测试并解释原因。

​		答：结果能够ping通192.168.1.1，但是不能上网（没有出网关的路由）。

　　原因分析：PC与RTA直连，ping命令使用的的ICMP报文这是属于**IP层**的报文不会使用到**路由表**查询，使用ARP寻路到达目标。

## 实验小结

#### 通过实验，可以得出关于静态路由和默认路由的哪些结论？

答：默认路由和静态路由有3种区别：

**1.功能有区别：**

静态路由指由用户或网络管理员手工配置的路由信息。默认路由是一种特殊的静态路由,指的是当路由表中与包的目的地址之间没有匹配的表项时路由器能够做出的选择。

**2.便捷程度有区别：**

如果出于安全的考虑想隐藏网络的某些部分或者管理员想控制数据转发路径，也会使用静态路由。在一个小而简单的网络中，也常使用静态 路由，因为配置静态路由会更为简捷。

**3.设置方式有区别：**

静态路由是管理员手动配置的，指明路由器下一条往那个口转发数据，静态路由的优先级和开销是仅次于直连路由，所以说在保证线路不中断的情况下，路由表比较稳定。与此相比默认路由是指路由没有明确的将数据包发往一个明确的目的地，路由器都启用默认路由。

## 实验心得

本次实验总体上还是比较顺利的。主要卡在了未开启端口，导致ping不通的情况。这个是因为自己对理论理解得不够深刻。当自己对路由器的工作机制有了足够的了解之后，通过排查解决了这个问题。感谢黄正军老师的实验指导！

